

function generate() {
    var quotes = {
        "-एडमंड मिबका": '"एक महान सकारात्मक व्यक्तित्व से ज्यादा आकर्षक कुछ भी नहीं. इसकी खूबसूरती समय के साथ कभी फीकी नहीं पड़ती। "',
        "-आचार्य चाणक्य1": '"जैसे एक बछड़ा हज़ारो गायों के झुंड मे अपनी माँ के पीछे चलता है। उसी प्रकार आदमी के अच्छे और बुरे कर्म उसके पीछे चलते हैं।"',
        "-आचार्य चाणक्य2": '"एक समझदार आदमी को सारस की तरह होश से काम लेना चाहिए और जगह, वक्त और अपनी योग्यता को समझते हुए अपने कार्य को सिद्ध करना चाहिए।"',
        "-पॉल पी. हैरिस": '"व्यक्तित्व में उत्थान करने की शक्ति होती है."',
        "-महात्मा गाँधी": '" खुद वो बदलाव बनिए जो दुनिया में आप देखना चाहते हैं."',
        "-ईलेनौर रूजवेल्ट ": '"आपकी इज़ाज़त के बिना कोई आपको नीचा नहीं दिखा सकता है."',
        "-मार्क ट्वैन": '"यदि आप सच बोलते हैं तो आपको कुछ याद रखने की ज़रुरत नहीं रहती."',
        "-कन्फ्यूशियस": '"उस काम का चयन कीजिये जिसे आप पसंद करते हों, फिर आप पूरी ज़िन्दगी एक दिन भी काम नहीं करंगे."',
        "-भगवान गौतम बुद्ध": '"तीन चीजें अधिक समय तक नहीं छुप सकती, सूरज, चंद्रमा और सत्य."',
        "-मार्क  ट्वैन": '"लड़ाई में कुत्ते का आकर मायने नहीं रखता, कुत्ते मं लड़ाई का आकार मायने रखता है."',
        "-नेपोलियन बोनापार्ट": '"मेरे शब्दकोष में असंभव शब्द नहीं है."',
        "-राल्फ वाल्डो इमर्सन": '"जीवन की लम्बाई नहीं , गहराई मायने रखती है"',
        "-शिव खेड़ा": '"जीतने वाले अलग चीजें नहीं करते, वो चीजों को  अलग तरह से करते हैं"',
        "-आचार्य चाणक्य3": '"ईश्वर मूर्तियों में नहीं है। आपकी भावनाएँ ही आपका ईश्वर है। आत्मा आपका मंदिर है।"',
        "-सुन जू1": '"सब लोग उन युक्तियों को देख सकते हैं जिनसे मैं विजय प्राप्त करता हूँ, लेकिन उन रणनीतियों को कोई नहीं देख सकता जिनसे विजय प्राप्त होती है।"',
        "-आचार्य चाणक्य4": '"पुस्तकें एक मुर्ख आदमी के लिए वैसे ही हैं, जैसे एक अंधे के लिए आइना।"',
        "-सुन जू2": '"वे जो जानते हैं की वो कब लड़ सकते हैं और कब नहीं , विजयी होंगे।"',
        "-आचार्य चाणक्य5": '"आग सिर में स्थापित करने पर भी जलाती है। अर्थात दुष्ट व्यक्ति का कितना भी सम्मान कर लें, वह सदा दुःख ही देता है।"',
        "-सुन जू3": '"अगर आप शत्रु से दूर हैं तो उन्हें विश्वास दिलाईये की आप निकट हैं।"',
        "-आचार्य चाणक्य6": '"गरीब धन की इच्छा करता है, पशु बोलने योग्य होने की, आदमी स्वर्ग की इच्छा करते हैं और धार्मिक लोग मोक्ष की।"',
        "-सुन जू4": '"हार से खुद को सुरक्षित करने का अवसर हमारे ही हाथों में निहित है, लेकिन दुश्मन को हराने के अवसर दुश्मन खुद द्वारा प्रदान की जाती है।"',
        "-आचार्य चाणक्य7": '"जो गुजर गया उसकी चिंता नहीं करनी चाहिए, ना ही भविष्य के बारे में चिंतिंत होना चाहिए। समझदार लोग केवल वर्तमान में ही जीते हैं।"',
    }


    var authors = Object.keys(quotes);


    var author = authors[Math.floor(Math.random() *
        authors.length)];
    
    var quote = quotes[author];
    
    document.getElementById("quote").innerHTML = quote;
    document.getElementById("author").innerHTML = author;

}